## Groupby

In [4]:
import pandas as pd
import numpy as np


speeds = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
         ],
    index = ["falcon", "paroot", "lion", "monkey", "leopard"],
    columns = ("class", "order", "max_speed"),
)

speeds

          class           order  max_speed
falcon     bird   Falconiformes      389.0
paroot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [6]:
grouped = speeds.groupby("class")
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001B4FA3A71A0>

In [8]:
grouped = speeds.groupby(["class", "order"])
print(grouped)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001B4FA3AB680>

In [10]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df

     A      B         C         D
0  foo    one -0.306010  1.215509
1  bar    one -0.533061 -0.050576
2  foo    two -0.379368  0.236846
3  bar  three  0.969531  1.520081
4  foo    two  0.800266 -0.892736
5  bar    two -0.760666 -1.573047
6  foo    one -0.564090  0.193570
7  foo  three -0.637295 -0.024543

In [11]:
grouped = df.groupby("A")

In [13]:
grouped = df.groupby("B")

In [14]:
grouped = df.groupby(["A", "B"])

In [17]:
df2 = df.set_index(["A", "B"])

grouped = df2.groupby(level = df2.index.names.difference(["B"]))
grouped.sum()

            C         D
A
bar -0.324195 -0.103541
foo -1.086497  0.728645

In [21]:
def get_letter_type(letter):
    if letter.lower() in "aeiou":
        return 'vowel'
    else:
        return 'consonant'

grouped = df.T.groupby(get_letter_type)

In [22]:
index = [1,2,3,1,2,3]
s = pd.Series([1,2,3,10,20,30], index = index)
s

1     1
2     2
3     3
1    10
2    20
3    30
dtype: int64

In [25]:
grouped = s.groupby(level=0)
grouped.first()

1    1
2    2
3    3
dtype: int64

In [26]:
grouped.last()

1    10
2    20
3    30
dtype: int64

In [27]:
grouped.sum()

1    11
2    22
3    33
dtype: int64

In [28]:
df2 = pd.DataFrame({"X": ["B","B","A","A"], "Y": [1,2,3,4]})
df2.groupby(["X"]).sum()

   Y
X
A  7
B  3

In [30]:
df2.groupby(["X"], sort=False).sum()

   Y
X
B  3
A  7

In [32]:
df3 = pd.DataFrame({"X": ["A","B","A","B"], "Y":[1,4,3,2]})
df3.groupby("X").get_group("A")

   X  Y
0  A  1
2  A  3

In [33]:
df3.groupby(["X"]).get_group(("B",))

   X  Y
1  B  4
3  B  2

In [34]:
df_list = [[1,2,3],[1,None,4],[2,1,3],[1,2,2]]
df_dropna = pd.DataFrame(df_list, columns=["a","b","c"])
df_dropna

   a    b  c
0  1  2.0  3
1  1  NaN  4
2  2  1.0  3
3  1  2.0  2

In [37]:
df_dropna.groupby(by=["b"], dropna=True).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [35]:
df_dropna.groupby(by=["b"], dropna=False).sum()

     a  c
b
1.0  2  3
2.0  2  5
NaN  1  4

In [36]:
df_dropna.groupby(by=["b"]).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [38]:
df.groupby("A").groups

{'bar': [1, 3, 5], 'foo': [0, 2, 4, 6, 7]}

In [39]:
df.T.groupby(get_letter_type).groups

{'consonant': ['B', 'C', 'D'], 'vowel': ['A']}

In [42]:
n = 10
weight = np.random.normal(166,20,size=n)
height = np.random.normal(60,10,size=n)
time = pd.date_range("1/1/2000", periods=n)
gender = np.random.choice(["male", "female"], size=n)

df = pd.DataFrame(
    {"height": height, "weight":weight, "gender":gender}, index=time)
df

               height      weight  gender
2000-01-01  77.830736  187.962004  female
2000-01-02  44.803075  171.069912  female
2000-01-03  68.847982  158.090675  female
2000-01-04  45.157509  171.635889    male
2000-01-05  51.515924  178.294398  female
2000-01-06  59.103459  161.825795  female
2000-01-07  68.619174  152.906794  female
2000-01-08  55.826593  154.871334  female
2000-01-09  74.757733  151.287234  female
2000-01-10  37.541056  160.808855    male

In [45]:
gb=df.groupby("gender")
gb

In [46]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]

index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
s = pd.Series(np.random.randn(8), index=index)
s

first  second
bar    one      -0.244591
       two       0.720881
baz    one      -0.446401
       two       1.470381
foo    one      -0.797143
       two       0.367194
qux    one      -1.308603
       two      -0.079896
dtype: float64

In [47]:
grouped = s.groupby(level=0)
grouped.sum()

first
bar    0.476289
baz    1.023980
foo   -0.429949
qux   -1.388499
dtype: float64

In [48]:
s.groupby(level="second").sum()

second
one   -2.796738
two    2.478560
dtype: float64

In [49]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["doo", "doo", "bee", "bee", "bop", "bop", "bop", "bop"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]

index = pd.MultiIndex.from_arrays(arrays, names=["first","second","third"])
s = pd.Series(np.random.randn(8), index=index)
s

first  second  third
bar    doo     one     -0.646804
               two      0.636786
baz    bee     one      0.035026
               two      0.304010
foo    bop     one      0.464125
               two      0.577017
qux    bop     one     -0.137704
               two     -0.214943
dtype: float64

In [50]:
s.groupby(level=["first","second"]).sum()

first  second
bar    doo      -0.010018
baz    bee       0.339036
foo    bop       1.041142
qux    bop      -0.352647
dtype: float64

In [51]:
s.groupby(["first","second"]).sum()

first  second
bar    doo      -0.010018
baz    bee       0.339036
foo    bop       1.041142
qux    bop      -0.352647
dtype: float64

In [52]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]

index = pd.MultiIndex.from_arrays(arrays, names=["first","second"])
df = pd.DataFrame({"A": [1, 1, 1, 1, 2, 2, 3, 3], "B": np.arange(8)}, index=index)
df

              A  B
first second
bar   one     1  0
      two     1  1
baz   one     1  2
      two     1  3
foo   one     2  4
      two     2  5
qux   one     3  6
      two     3  7

In [53]:
df.groupby([pd.Grouper(level=1), "A"]).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

In [55]:
df.groupby([pd.Grouper(level="second"),"A"]).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

In [56]:
df.groupby(["second","A"]).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

In [57]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  0.179729 -1.469559
1  bar    one  0.172896 -0.336321
2  foo    two  2.217009  0.998569
3  bar  three -0.408730 -0.089739
4  foo    two -1.918917  1.032849
5  bar    two  0.943051  1.581047
6  foo    one -0.390017  0.421509
7  foo  three -0.356461  1.876042

In [58]:
grouped = df.groupby(["A"])
grouped_C = grouped["C"]
grouped_D = grouped["D"]

In [59]:
df["C"].groupby(df["A"])

In [60]:
grouped[["A","B"]].sum()

                   A                  B
A
bar        barbarbar        onethreetwo
foo  foofoofoofoofoo  onetwotwoonethree

In [62]:
grouped = df.groupby('A')
for name, group in grouped:
    print(name)
    print(group)

bar
     A      B         C         D
1  bar    one  0.172896 -0.336321
3  bar  three -0.408730 -0.089739
5  bar    two  0.943051  1.581047
foo
     A      B         C         D
0  foo    one  0.179729 -1.469559
2  foo    two  2.217009  0.998569
4  foo    two -1.918917  1.032849
6  foo    one -0.390017  0.421509
7  foo  three -0.356461  1.876042

In [63]:
for name, group in df.groupby(['A', 'B']):
    print(name)
    print(group)

('bar', 'one')
     A    B         C         D
1  bar  one  0.172896 -0.336321
('bar', 'three')
     A      B        C         D
3  bar  three -0.40873 -0.089739
('bar', 'two')
     A    B         C         D
5  bar  two  0.943051  1.581047
('foo', 'one')
     A    B         C         D
0  foo  one  0.179729 -1.469559
6  foo  one -0.390017  0.421509
('foo', 'three')
     A      B         C         D
7  foo  three -0.356461  1.876042
('foo', 'two')
     A    B         C         D
2  foo  two  2.217009  0.998569
4  foo  two -1.918917  1.032849

In [64]:
grouped.get_group("bar")

     A      B         C         D
1  bar    one  0.172896 -0.336321
3  bar  three -0.408730 -0.089739
5  bar    two  0.943051  1.581047

In [65]:
df.groupby(["A","B"]).get_group(("bar","one"))

     A    B         C         D
1  bar  one  0.172896 -0.336321

In [66]:
animals = pd.DataFrame(
    {
        "kind": ["cat", "dog", "cat", "dog"],
        "height": [9.1, 6.0, 9.5, 34.0],
        "weight": [7.9, 7.5, 9.9, 198.0],
    }
)
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [67]:
animals.groupby("kind").sum()

      height  weight
kind
cat     18.6    17.8
dog     40.0   205.5

In [68]:
animals.groupby("kind", as_index=False).sum()

  kind  height  weight
0  cat    18.6    17.8
1  dog    40.0   205.5

In [69]:
df.groupby("A")[["C","D"]].max()

            C         D
A
bar  0.943051  1.581047
foo  2.217009  1.876042

In [71]:
df.groupby(["A","B"]).mean()

                  C         D
A   B
bar one    0.172896 -0.336321
    three -0.408730 -0.089739
    two    0.943051  1.581047
foo one   -0.105144 -0.524025
    three -0.356461  1.876042
    two    0.149046  1.015709

In [72]:
grouped = df.groupby(["A","B"])
grouped.size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

In [73]:
grouped.describe()

              C                                                              \
          count      mean       std       min       25%       50%       75%
A   B
bar one     1.0  0.172896       NaN  0.172896  0.172896  0.172896  0.172896
    three   1.0 -0.408730       NaN -0.408730 -0.408730 -0.408730 -0.408730
    two     1.0  0.943051       NaN  0.943051  0.943051  0.943051  0.943051
foo one     2.0 -0.105144  0.402871 -0.390017 -0.247581 -0.105144  0.037292
    three   1.0 -0.356461       NaN -0.356461 -0.356461 -0.356461 -0.356461
    two     2.0  0.149046  2.924541 -1.918917 -0.884935  0.149046  1.183028

                        D                                                    \
                max count      mean       std       min       25%       50%
A   B
bar one    0.172896   1.0 -0.336321       NaN -0.336321 -0.336321 -0.336321
    three -0.408730   1.0 -0.089739       NaN -0.089739 -0.089739 -0.089739
    two    0.943051   1.0  1.581047       NaN  1.581047  1.581047  1.581047
foo one    0.179729   2.0 -0.524025  1.337186 -1.469559 -0.996792 -0.524025
    three -0.356461   1.0  1.876042       NaN  1.876042  1.876042  1.876042
    two    2.217009   2.0  1.015709  0.024240  0.998569  1.007139  1.015709


                75%       max
A   B
bar one   -0.336321 -0.336321
    three -0.089739 -0.089739
    two    1.581047  1.581047
foo one   -0.051258  0.421509
    three  1.876042  1.876042
    two    1.024279  1.032849

In [76]:
ll = [['foo',1],['foo',2],['foo',2],['bar',1],['bar',1]]
df4 = pd.DataFrame(ll, columns=["A","B"])
df4

     A  B
0  foo  1
1  foo  2
2  foo  2
3  bar  1
4  bar  1

In [77]:
df4.groupby("A")["B"].nunique()

A
bar    1
foo    2
Name: B, dtype: int64

In [82]:
grouped = df.groupby("A")
grouped[["C","D"]].aggregate("sum")

            C         D
A
bar  0.707217  1.154987
foo -0.268657  2.859410

In [83]:
grouped = df.groupby(["A","B"])
grouped.agg("sum")

                  C         D
A   B
bar one    0.172896 -0.336321
    three -0.408730 -0.089739
    two    0.943051  1.581047
foo one   -0.210288 -1.048050
    three -0.356461  1.876042
    two    0.298093  2.031418

In [84]:
grouped = df.groupby(["A","B"], as_index=False)
grouped.agg("sum")

     A      B         C         D
0  bar    one  0.172896 -0.336321
1  bar  three -0.408730 -0.089739
2  bar    two  0.943051  1.581047
3  foo    one -0.210288 -1.048050
4  foo  three -0.356461  1.876042
5  foo    two  0.298093  2.031418

In [85]:
df.groupby("A",as_index=False)[["C","D"]].agg("sum")

     A         C         D
0  bar  0.707217  1.154987
1  foo -0.268657  2.859410

In [86]:
df.groupby(["A","B"]).agg("sum").reset_index()

     A      B         C         D
0  bar    one  0.172896 -0.336321
1  bar  three -0.408730 -0.089739
2  bar    two  0.943051  1.581047
3  foo    one -0.210288 -1.048050
4  foo  three -0.356461  1.876042
5  foo    two  0.298093  2.031418

In [87]:
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [88]:
animals.groupby("kind")[["height"]].agg(lambda x: set(x))

           height
kind
cat    {9.1, 9.5}
dog   {34.0, 6.0}

In [89]:
animals.groupby("kind")[["height"]].agg(lambda x: x.astype(int).sum())

      height
kind
cat       18
dog       40

In [90]:
grouped = df.groupby("A")
grouped["C"].agg(["sum", "mean", "std"])

          sum      mean       std
A
bar  0.707217  0.235739  0.678078
foo -0.268657 -0.053731  1.491175

In [91]:
grouped[["C", "D"]].agg(["sum", "mean", "std"])

            C                             D
          sum      mean       std       sum      mean       std
A
bar  0.707217  0.235739  0.678078  1.154987  0.384996  1.043122
foo -0.268657 -0.053731  1.491175  2.859410  0.571882  1.253543

In [92]:
(
    grouped["C"]
    .agg(["sum", "mean", "std"])
    .rename(columns={"sum": "foo", "mean": "bar", "std": "baz"})
)

          foo       bar       baz
A
bar  0.707217  0.235739  0.678078
foo -0.268657 -0.053731  1.491175

In [93]:
(
    grouped[["C", "D"]].agg(["sum", "mean", "std"]).rename(
        columns={"sum": "foo", "mean": "bar", "std": "baz"}
    )
)

            C                             D
          foo       bar       baz       foo       bar       baz
A
bar  0.707217  0.235739  0.678078  1.154987  0.384996  1.043122
foo -0.268657 -0.053731  1.491175  2.859410  0.571882  1.253543

In [95]:
grouped["C"].agg(["sum","sum"])

          sum       sum
A
bar  0.707217  0.707217
foo -0.268657 -0.268657

In [97]:
grouped["C"].agg([lambda x: x.max() -x.min(), lambda x: x.median() - x.mean()])

     <lambda_0>  <lambda_1>
A
bar    1.351781   -0.062843
foo    4.135926   -0.302730

In [99]:
animals

  kind  height  weight
0  cat     9.1     7.9
1  dog     6.0     7.5
2  cat     9.5     9.9
3  dog    34.0   198.0

In [100]:
animals.groupby("kind").agg(
    min_geight=pd.NamedAgg(column="height", aggfunc="min"),
    max_height=pd.NamedAgg(column="height", aggfunc="max"),
    average_weight=pd.NamedAgg(column="weight", aggfunc="mean"),
)

      min_geight  max_height  average_weight
kind
cat          9.1         9.5            8.90
dog          6.0        34.0          102.75

In [102]:
animals.groupby("kind").agg(
                min_height=("height", "min"),
                max_height=("height", "max"),
                average_weight=("weight", "mean"),)

      min_height  max_height  average_weight
kind
cat          9.1         9.5            8.90
dog          6.0        34.0          102.75

In [103]:
animals.groupby("kind").agg(
    **{"total weight": pd.NamedAgg(column="weight", aggfunc="sum")})

      total weight
kind
cat           17.8
dog          205.5